hi @kishorj 
this is a snippet of what I'm trying to achieve.
```
resource "kubernetes_ingress_class" "kubernetes_ingress_class" {
  metadata {
    name = "alb-internal"
  }

  spec {
    controller = "elbv2.k8s.aws/alb"
    # parameters {
    #   api_group = "elbv2.k8s.aws"
    #   kind      = "IngressClassParams"
    #   name      = "alb-internal"
    # }
  }

  depends_on = [
    helm_release.lbc,
  ]
}
output "kubernetes_ingress_class" { value = kubernetes_ingress_class.kubernetes_ingress_class }

# resource "kubectl_manifest" "IngressClassParameters" {
#   yaml_body = <<YAML
# apiVersion: elbv2.k8s.aws/v1beta1
# kind: IngressClassParams
# metadata:
#   name: alb-internal
#   annotations:
#   labels:
# spec:
#   scheme: internal
#   ipAddressType: dualstack
# YAML
# }

# resource "kubernetes_ingress" "Ingress" {
#   metadata {
#     name      = "ingress1"
#     namespace = "awslbc"
#     annotations = {
#       "alb.ingress.kubernetes.io/group.name"                          = "my_team.my_group"
#       "alb.ingress.kubernetes.io/manage-backend-security-group-rules" = false
#       "alb.ingress.kubernetes.io/scheme"                              = "internal"
#       "alb.ingress.kubernetes.io/target-type"                         = "ip"
#       "alb.ingress.kubernetes.io/subnets"                             = join(",", data.aws_subnets.private_subnets.ids)
#       "alb.ingress.kubernetes.io/security-groups"                     = join(",", data.aws_security_groups.awslbc_eks_sg.ids)
#     }
#   }
#   spec {
#     ingress_class_name = "alb-internal"
#     rule {
#       http {
#         path {
#           path = "/*"
#           backend {
#             service {
#               name = "foobar"
#               port {
#                 number = 80
#               }
#             }
#           }
#         }
#       }
#     }
#   }

#   depends_on = [
#     helm_release.lbc,
#     kubernetes_ingress_class.kubernetes_ingress_class,
#   ]
# }

resource "kubectl_manifest" "Ingress" {
  yaml_body = <<YAML
apiVersion: extensions/v1beta1
kind: Ingress
metadata:
  namespace: awslbc
  name: ingress2
  annotations:
    alb.ingress.kubernetes.io/group.name: my_group
    alb.ingress.kubernetes.io/scheme: internal
    alb.ingress.kubernetes.io/target-type: ip
    alb.ingress.kubernetes.io/subnets: ${join(",", data.aws_subnets.private_subnets.ids)}
    alb.ingress.kubernetes.io/security-groups: ${join(",", data.aws_security_groups.awslbc_eks_sg.ids)}
    alb.ingress.kubernetes.io/actions.default: |
      {"Type":"fixed-response","FixedResponseConfig":{"ContentType":"application/json","StatusCode":"403","MessageBody":"{ \"code\" : 403, \"message\" : \"The requested URI is forbidden, please use the correct URI\" }"}}
spec:
  ingressClassName: alb-internal
  rules:
  - http:
      paths:
        - path: /
          backend:
            serviceName: default
            servicePort: use-annotation
YAML

  depends_on = [
    helm_release.lbc,
    kubernetes_ingress_class.kubernetes_ingress_class,
  ]
}
```

which results on this plan:
```
  # module.lbc.kubernetes_ingress_class.kubernetes_ingress_class will be created
  + resource "kubernetes_ingress_class" "kubernetes_ingress_class" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "alb-internal"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + controller = "elbv2.k8s.aws/alb"
        }
    }

  # module.lbc.kubectl_manifest.Ingress will be created
  + resource "kubectl_manifest" "Ingress" {
      + api_version             = "extensions/v1beta1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Ingress"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ingress2"
      + namespace               = "awslbc"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: extensions/v1beta1
            kind: Ingress
            metadata:
              annotations:
                alb.ingress.kubernetes.io/actions.default: |
                  {"Type":"fixed-response","FixedResponseConfig":{"ContentType":"application/json","StatusCode":"403","MessageBody":"{ \"code\" : 403, \"message\" : \"The requested URI is forbidden, please use the correct URI\" }"}}
                alb.ingress.kubernetes.io/group.name: my_group
                alb.ingress.kubernetes.io/scheme: internal
                alb.ingress.kubernetes.io/security-groups: sg-XXX
                alb.ingress.kubernetes.io/subnets: subnet-xxxx,subnet-xxxx,subnet-xxxx,subnet-xxxx,subnet-xxxx
                alb.ingress.kubernetes.io/target-type: ip
              name: ingress2
              namespace: awslbc
            spec:
              ingressClassName: alb-internal
              rules:
              - http:
                  paths:
                  - backend:
                      serviceName: default
                      servicePort: use-annotation
                    path: /
        EOT
      + yaml_incluster          = (sensitive value)
    }
```
the controller logs don't show any activity
![image](https://user-images.githubusercontent.com/168366/159256665-d2eab531-dbe0-4f6c-a6b9-47465daa3d6a.png)

here's the cluster resources
![image](https://user-images.githubusercontent.com/168366/159256863-9035fcb4-8a79-45a2-8fb2-e116c505ec6a.png)
